const data = {
    "questions": [
      {
        "question": "Хэрхэн харилцагчаар бүртгүүлэх вэ?",
        "answerText":[
        "Та VALU UP  аппликэйшныг App store, Play Store-с гар утсан дээрээ суулган бүртгэл үүсгэнэ.",
        "Бүртгэл үүсгэхийн тулд дараах мэдээллийг бөглөнө үү."
      ],
        "answer": [
          "Овог ",
          "Нэр ",
          "Утасны дугаар",
          "Регистрийн дугаар "
        ]
      },
      {
        "question": "Хэрэв бүртгэлтэй бол хэрхэн аппликейшнд нэвтрэх вэ?",
        "answerText": "Та өөрийн нэвтрэх нэр болон нууц үгийг ашиглан аппликейшнд нэвтэрнэ. Хэрэв нэвтрэх нэр эсвэл нууц үгээ мартсан бол дэлгэцэн дээр харагдах “Нууц үг, нэвтрэх нэр мартсан” товчийг дарж, бүртгэлтэй утасны дугаар эсвэл имэйл хаягаа ашиглан бүртгэлээ баталгаажуулж, сэргээх боломжтой",
        "answer": []
      },

      {
        "question": "Бүртгэлтэй утасны дугаараа хэрхэн өөрчлөх вэ?",
        "answerText": "Аппликейшнд нэвтрэн, “Хувийн профайл” хэсгийн “Миний мэдээлэл” хэсэг рүү орон “Утасны дугаар” талбарыг сонгон өөрчлөлт хийнэ.",
         "answer": []
      },

      {
        "question": "Нэвтрэх нэрээ хэрхэн солих вэ?",
        "answerText": [
      "Таны нэвтрэх нэр 'Хувийн профайл' хэсгийн дээд хэсэгт байрлана. Та "Засах" товчийг дарснаар шинэ нэвтрэх нэрээ оруулж өөрчлөх боломжтой.", 
       "Анхааруулга: Нэвтрэх нэрээ анх удаа сольсны дараа та зөвхөн шинэ нэвтрэх нэрээрээ аппликейшнд нэвтрэх боломжтой."
      ],
       "answer": []
      },

      {
        "question": "Хувийн мэдээллээ хэрхэн шинэчлэх вэ?",
        "answerText": [
      "Та 'Миний профайл' цэс доторх 'Хувийн мэдээлэл' болон 'Нэмэлт мэдээлэл' хэсгүүдэд өөрчлөлт оруулж, хувийн мэдээллээ шинэчлэх боломжтой.", 
       "Анхааруулга: Хувийн мэдээллийг шинэчилснээр таны мэдээлэл хадгалагдах боловч зээлийн эрхийн тооцоололд нөлөөлөхгүй буюу зээлийн эрхийг дахин тооцоолохгүй юм. "
      ],
       "answer": []
      },

      {
        "question": "Зээлийн эрх хэрхэн тооцоолуулах вэ?",
        "answerText": "Та 'Зээлийн эрх үүсгэх' товчийг дарж, үйлчилгээний хураамжийг төлсний дараа ДАН системээр өөрийн бүртгэлээр нэвтэрнэ. Үүний үндсэн дээр таны НДШ-ийн мэдээлэлд тулгуурлан зээлийн эрхийг тооцоолно.",
         "answer": []
      },

      {
        "question": "Зээл хэрхэн авах вэ?",
        "answerText": "Зээлийн эрхээ тооцоолуулсны дараа, таны авах боломжтой зээлийн хэмжээ системд харагдана. Та уг хэмжээнд тохируулан зээлээ авах боломжтой.",
         "answer": []
      },

      {
        "question": "Зээл хэрхэн эргэн төлөх вэ?",
        "answerText": "Та VALU UP аппликейшны 'Идэвхтэй зээл' хэсэгт хандан төлөх зээлийнхээ мэдээллийг харах боломжтой. Сонгосон зээлийн дэлгэрэнгүй хэсэгт нэвтэрч, төлбөрөө зээлээ төлнө",
         "answer": []
      },

      {
        "question": "Хуваан төлөх боломжтой юу?",
        "answerText": "Та өөрийн зээлийг 10,000₮-с дээш ямар ч дүнгээр, хэд ч хуваан төлөх боломжтой",
         "answer": []
      },

      {
        "question": "Зээлээ хэрхэн хувааж төлөх вэ?",
        "answerText": "Та зээлийн дэлгэрэнгүй хэсэгт хандаж, "Зээл төлөх" товчийг дарснаар хүссэн дүнгээрээ хуваан төлөх боломжтой.",
         "answer": []
      },

      {
        "question": "Зээлийн хугацаа хэтэрвэл яах вэ?",
        "answerText": "Хэрэв таны зээл 15 хоногоос дээш хугацаагаар хэтэрвэл,  6 сарын хугацаанд аппликейшнд хандах эрхийг түр хязгаарлана. Энэ хугацаа дууссаны дараа та дахин зээлийн эрхээ тооцоолуулан зээл авах боломжтой.",
         "answer": []
      },

      {
        "question": "Зээлээ төлөөд дахин зээл авах боломжтой юу?",
        "answerText": "Та зээлээ хуваан төлсөн эсвэл хаасан тохиолдолд, таны зээлийн нийт авах боломжит эрхийн дүнгээр таны данс эргэн цэнэглэгдэж, дахин зээл авах боломжтой болно.",
         "answer": []
      },

      {
        "question": "Нууц үгээ хэрхэн сэргээх вэ?",
        "answerText": "Хэрэв та өөрийн аппликейшнд нэвтрэх нууц үгээ мартсан бол "Нууц үг мартсан уу?" товчийг дарж, бүртгэлтэй утасны дугаараа баталгаажуулан шинэ нууц үг үүсгэх боломжтой. ",
        "answer": []
      },

    ]
  };

  function renderFAQ(data) {
      const faqContainer = document.getElementById("faq");

      data.questions.forEach(item => {
          const details = document.createElement("details");
          const summary = document.createElement("summary");
          summary.textContent = item.question;
          
          details.appendChild(summary);

          const answerTextArray = Array.isArray(item.answerText) ? item.answerText : [item.answerText];
      
      answerTextArray.forEach(text => {
          const paragraph = document.createElement("p");
          const modifiedText = text.replace(/([^\.]*Анхааруулга[^\.]*\.)/gi, '<span class="highlight">$1</span>');
          paragraph.innerHTML = modifiedText;
          details.appendChild(paragraph);
      });


          if (item.answer.length > 0) {
              const answerList = document.createElement("ul");
              item.answer.forEach(answer => {
                  const listItem = document.createElement("li");
                  listItem.textContent = answer;
                  answerList.appendChild(listItem);
              });
              details.appendChild(answerList);
          }

          faqContainer.appendChild(details);
      });
  }

  renderFAQ(data);
