const data = {
    "questions": [
      {
        "question": "Хэрхэн харилцагчаар бүртгүүлэх вэ?",
        "answerText":[
        "Бүртгэл үүсгэхдээ дараах мэдээллүүдийг бөглөнө.",
        "Та манай аппликейшныг App store, Play store-с гар утсан дээрээ суулган бүртгэл үүсгэнэ"
      ],
        "answer": [
          "Овог ",
          "Нэр ",
          "Утасны дугаар",
          "Регистрийн дугаар "
        ]
      },
      {
        "question": "Хэрэв бүртгэлтэй бол хэрхэн аппликейшнд нэвтрэх вэ?",
        "answerText": "Та өөрийн нэвтрэх нэрээр аппликейшнд нэвтрэх ба хэрэв нэвтрэх нэр ээ мартсан бол дэлгэцэн дээр харагдах “Нууц үг, нэвтрэх нэр мартсан” товчийг дарж бүртгэлтэй утасны дугаар/ имэйл хаягаар бүртгэлээ баталгаажуулан сэргээнэ",
        "answer": []
      },

      {
        "question": "Утасны дугаар хэрхэн солих вэ?",
        "answerText": "Аппликейшнд нэвтрэн “Хувийн профайл” хэсэг рүү орон “Миний мэдээлэл” хэсэгт нэвтрэн “Утасны дугаар” талбарт даран утасны дугаараа солино",
         "answer": []
      },

      {
        "question": "Нэвтрэх нэрээ хэрхэн солих вэ?",
        "answerText": [
      "Аппликейшны “Хувийн профайл” хамгийн дээд хэсэгт нэвтрэх нэр байрлаж байгаа бөгөөд та “Засах” товч дээр даран өөрийн нэвтрэх нэрийг солино.", 
       "Анхааруулга: Та анх удаа нэвтрэх нэрээ сольсноор цааш аппликейшнд нэвтрэхдээ шинэчилсэн нэвтрэх нэрээр нэвтрэх болно."
      ],
       "answer": []
      },

      {
        "question": "Хувийн мэдээллээ хэрхэн солих вэ?",
        "answerText": [
      "“Миний профайл” цэс дотор байрлах “Хувийн мэдээлэл”, “Нэмэлт мэдээлэл” талбарууд руу орон хувийн мэдээллийг солих боломжтой байна.", 
       "Анхааруулга: Хувийн мэдээллийг сольсноор бид зөвхөн таны хувийн мэдээллийг хадгалж авах бөгөөд зээлийн эрхийг дахин тооцоолохгүй юм. "
      ],
       "answer": []
      },

      {
        "question": "Зээлийн эрх хэрхэн тооцоолуулах вэ?",
        "answerText": "Та аппликейшнд нэвтрэн “Зээлийн эрх үүсгэх” товчийг даран үйлчилгээний хураамжийг төлөн ДАН системд өөрийн бүртгэлээр нэвтэрснээр таны НДШ-н мэдээлэл дээр үндэслэн бид таны зээлийн эрхийг тооцоолох болно.",
         "answer": []
      },

      {
        "question": "Зээл хэрхэн авах вэ?",
        "answerText": "Зээлийн эрх тооцоолуулснаар таны зээл авах боломжит хэмжээг систем гаргаж өгөх бөгөөд та өөрийн зээлийн авах боломжит хэмжээнд тааруулан зээл авах боломжтой.",
         "answer": []
      },

      {
        "question": "Зээл хэрхэн эргэн төлөх вэ?",
        "answerText": "VALU PLUS аппликейшныг ашиглан “Идэвхтэй зээл” хэсгээс өөрийн төлөх, хаах зээлийн сонгосноор зээлийн дэлгэрэнгүй хэсэг рүү нэвтрэн төлөх боломжтой.",
         "answer": []
      },

      {
        "question": "Хувааж төлөх боломжтой юу?",
        "answerText": "Та 10,000₮-с дээш өөрийн зээлийг ямар ч дүнгээр, хэд ч хуваан төлөх боломжтой",
         "answer": []
      },

      {
        "question": "Хэрхэн хувааж төлөх вэ?",
        "answerText": "Та зээлийн дэлгэрэнгүй хэсгээс зээл төлөх товчийг даран хүссэн дүнгээр зээлээ хуваан төлөх боломжтой.",
         "answer": []
      },

      {
        "question": "Зээлийн хугацаа хэтэрвэл яах вэ?",
        "answerText": "Хэрэглэгчийн зээл 15 хоногоос дээш хугацаа хэтэрсэн тохиолдолд хэрэглэгчийг 6 сарын турш аппликейшнээс бандах бөгөөд түүний дараагаар та дахин зээлийн эрхээ тооцуулан зээл авах боломжтой",
         "answer": []
      },

      {
        "question": "Зээлээ төлөөд дахин зээл авах боломжтой юу?",
        "answerText": "Таны зээлийн нийт авах боломжит эрхийн дүнгээс та зээлээ хувааж төлөх, хаах үйлдэл хийгдсэний дараагаар тухайн мөнгөн дүнгээр таны данс эргэн цэнэглэгдэх болно",
         "answer": []
      },

      {
        "question": "Нууц үгээ хэрхэн сэргээх вэ?",
        "answerText": "Хэрэглэгч та өөрийн аппликейшнд нэвтрэх нууц үгээ мартсан бол нууц үг мартсан уу товчийг даран бүртгэлтэй утасны дугаарыг баталгаажуулан нэвтрэх нууц үгийг солих боломжтой.",
        "answer": []
      },

    ]
  };

  function renderFAQ(data) {
      const faqContainer = document.getElementById("faq");

      data.questions.forEach(item => {
          const details = document.createElement("details");
          const summary = document.createElement("summary");
          summary.textContent = item.question;
          
          details.appendChild(summary);

          const answerTextArray = Array.isArray(item.answerText) ? item.answerText : [item.answerText];
      
      answerTextArray.forEach(text => {
          const paragraph = document.createElement("p");
          const modifiedText = text.replace(/([^\.]*Анхааруулга[^\.]*\.)/gi, '<span class="highlight">$1</span>');
          paragraph.innerHTML = modifiedText;
          details.appendChild(paragraph);
      });


          if (item.answer.length > 0) {
              const answerList = document.createElement("ul");
              item.answer.forEach(answer => {
                  const listItem = document.createElement("li");
                  listItem.textContent = answer;
                  answerList.appendChild(listItem);
              });
              details.appendChild(answerList);
          }

          faqContainer.appendChild(details);
      });
  }

  renderFAQ(data);
